benchmarking/benchmark-integration-wrk/src/test/resources/optimized-wrk-health-output.txt
Running 15s test @ https://localhost:10443/q/health/live
  4 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.88ms  751.15us  32.52ms   91.82%
    Req/Sec     6.08k   485.56     7.13k    83.44%
  Latency Distribution
     50%  702.00us
     75%    0.99ms
     90%    1.50ms
     99%    3.79ms
  365242 requests in 15.10s, 54.34MB read
Requests/sec:  24184.90
Transfer/sec:      3.60MB
=== WRK Health Check Benchmark Results ===
Requests:      365242
Duration:      15.10s
Avg Latency:   0.88ms
Max Latency:   32.52ms
Req/sec:       24184.90
Errors:        0
50th pct:      0.70ms
90th pct:      1.50ms
99th pct:      3.79ms