benchmarking/benchmark-integration-wrk/src/test/resources/real-wrk-health-output.txt
Running 15s test @ https://localhost:10443/q/health/live
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.89ms   66.63ms 611.70ms   83.47%
    Req/Sec     7.79k     2.07k   17.53k    71.91%
  Latency Distribution
     50%    1.96ms
     75%   49.28ms
     90%  145.25ms
     99%  202.49ms
  463630 requests in 15.10s, 68.98MB read
Requests/sec:  30701.44
Transfer/sec:      4.57MB