benchmarking/benchmark-integration-wrk/src/test/resources/real-wrk-jwt-output.txt
/Users/oliver/git/cui-jwt/benchmarking/benchmark-integration-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua: ...ion-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua:4: module 'json' not found:
	no field package.preload['json']
	no file './json.lua'
	no file '/usr/local/share/luajit-2.1/json.lua'
	no file '/usr/local/share/lua/5.1/json.lua'
	no file '/usr/local/share/lua/5.1/json/init.lua'
	no file './json.so'
	no file '/usr/local/lib/lua/5.1/json.so'
	no file '/usr/local/lib/lua/5.1/loadall.so'
/Users/oliver/git/cui-jwt/benchmarking/benchmark-integration-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua: ...ion-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua:4: module 'json' not found:
	no field package.preload['json']
	no file './json.lua'
	no file '/usr/local/share/luajit-2.1/json.lua'
	no file '/usr/local/share/lua/5.1/json.lua'
	no file '/usr/local/share/lua/5.1/json/init.lua'
	no file './json.so'
	no file '/usr/local/lib/lua/5.1/json.so'
	no file '/usr/local/lib/lua/5.1/loadall.so'
/Users/oliver/git/cui-jwt/benchmarking/benchmark-integration-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua: ...ion-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua:4: module 'json' not found:
	no field package.preload['json']
	no file './json.lua'
	no file '/usr/local/share/luajit-2.1/json.lua'
	no file '/usr/local/share/lua/5.1/json.lua'
	no file '/usr/local/share/lua/5.1/json/init.lua'
	no file './json.so'
	no file '/usr/local/lib/lua/5.1/json.so'
	no file '/usr/local/lib/lua/5.1/loadall.so'
/Users/oliver/git/cui-jwt/benchmarking/benchmark-integration-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua: ...ion-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua:4: module 'json' not found:
	no field package.preload['json']
	no file './json.lua'
	no file '/usr/local/share/luajit-2.1/json.lua'
	no file '/usr/local/share/lua/5.1/json.lua'
	no file '/usr/local/share/lua/5.1/json/init.lua'
	no file './json.so'
	no file '/usr/local/lib/lua/5.1/json.so'
	no file '/usr/local/lib/lua/5.1/loadall.so'
/Users/oliver/git/cui-jwt/benchmarking/benchmark-integration-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua: ...ion-wrk/src/main/resources/wrk-scripts/jwt_benchmark.lua:4: module 'json' not found:
	no field package.preload['json']
	no file './json.lua'
	no file '/usr/local/share/luajit-2.1/json.lua'
	no file '/usr/local/share/lua/5.1/json.lua'
	no file '/usr/local/share/lua/5.1/json/init.lua'
	no file './json.so'
	no file '/usr/local/lib/lua/5.1/json.so'
	no file '/usr/local/lib/lua/5.1/loadall.so'
Running 30s test @ https://localhost:10443/api/v1/jwt/extract
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.07ms   67.21ms 607.31ms   82.87%
    Req/Sec     7.12k     1.82k   13.88k    69.12%
  Latency Distribution
     50%    2.00ms
     75%   59.85ms
     90%  148.71ms
     99%  202.24ms
  848646 requests in 30.10s, 112.50MB read
  Non-2xx or 3xx responses: 848646
Requests/sec:  28192.77
Transfer/sec:      3.74MB